gingerologist/nrf5_sdk_17_10/examples/ble_peripheral/ble_app_sleepmon/main.c
BLE_EEG_DEF(m_eeg);
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                             /**< Advertising module instance. */

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

/*
 *  NRFX_TWIM_ENABLED         1
 *  NRFX_TWI_ENABLED          1
 *  TWI_ENABLED               1
 *  TWI1_ENABLED              1
 *  TWI0_USE_EASY_DMA	        0
 *  NRF_TWI_MNGR_ENABLED (optional, if twi_mngr is used)
 */
#define TWI1_INSTANCE_ID                1
#define TWI1_MAX_PENDING_TRANSACTIONS   4
#define QMI8658A_SCL_PIN                21      // P0.21
#define QMI8658A_SDA_PIN                19      // P0.19
#define QMI8658A_INT1_PIN               20      // P0.20
#define QMI8658A_INT2_PIN               22      // P0.22

// use twi manager instead
// static const nrf_drv_twi_t twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE);
NRF_TWI_MNGR_DEF(m_nrf_twi_mngr, TWI1_MAX_PENDING_TRANSACTIONS, TWI1_INSTANCE_ID);
static nrf_drv_twi_config_t const qmi8658a_twi_config = {
    .scl                = QMI8658A_SCL_PIN,
    .sda                = QMI8658A_SDA_PIN,
    .frequency          = NRF_DRV_TWI_FREQ_400K,
    .interrupt_priority = TWI_DEFAULT_CONFIG_IRQ_PRIORITY,  // todo
    .clear_bus_init     = TWI_DEFAULT_CONFIG_CLR_BUS_INIT,
    .hold_bus_uninit    = TWI_DEFAULT_CONFIG_HOLD_BUS_UNINIT,
};

static void qmi8658a_int2_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action);

static qmi8658a_dev_t qmi8658a_dev = {
    .p_twi_mngr         = &m_nrf_twi_mngr,
    .p_twi_cfg          = &qmi8658a_twi_config,
    .int1_pin           = QMI8658A_INT1_PIN,
    .int1_evt_handler   = NULL,
    .int2_pin           = QMI8658A_INT2_PIN,
    .int2_evt_handler   = qmi8658a_int2_handler
};

#define SPI0_INSTANCE_ID                0
#define SPI0_MAX_PENDING_TRANSACTIONS   4

#define KS1092_RST_PIN                  6       // P0.06
#define KS1092_SS_PIN                   7       // P0.07
#define KS1092_SCK_PIN                  8       // P0.08
#define KS1092_MISO_PIN                 17      // P0.17 (PIN20)
#define KS1092_MOSI_PIN                 18      // P0.18 (PIN21)

NRF_SPI_MNGR_DEF(m_nrf_spi_mngr, SPI0_MAX_PENDING_TRANSACTIONS, SPI0_INSTANCE_ID);
static nrf_drv_spi_config_t const ks1092_spi_config = {
    .sck_pin            = KS1092_SCK_PIN,
    .mosi_pin           = KS1092_MOSI_PIN,
    .miso_pin           = KS1092_MISO_PIN,
    .ss_pin             = KS1092_SS_PIN,
    .irq_priority       = SPI_DEFAULT_CONFIG_IRQ_PRIORITY,
    .orc                = 0xFF,
    .frequency          = NRF_DRV_SPI_FREQ_1M,
    .mode               = NRF_DRV_SPI_MODE_1, // !!! important
    .bit_order          = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST
};

static nrfx_gpiote_out_config_t const ks1092_reset_pin_out_config = NRFX_GPIOTE_CONFIG_OUT_SIMPLE(true);

static ks1092_dev_t ks1092_dev = {
    .p_spi_mngr         = &m_nrf_spi_mngr,
    .p_spi_cfg          = &ks1092_spi_config,
    .reset_pin          = KS1092_RST_PIN,
    .p_reset_pin_cfg    = &ks1092_reset_pin_out_config
};

NRF_LIBUARTE_ASYNC_DEFINE(
    libuarte,
    0,    // _uarte_idx, UARTE instance used.
    2,    // _timer0_idx, TIMER instance used by libuarte for bytes counting.

    // _rtc1_idx, RTC instance used for timeout.
    // If set to NRF_LIBUARTE_PERIPHERAL_NOT_USED then TIMER instance is used
    // or app_timer instance if _timer1_idx is also set to NRF_LIBUARTE_PERIPHERAL_NOT_USED.
    NRF_LIBUARTE_PERIPHERAL_NOT_USED,

    // _timer1_idx, TIMER instance used for timeout.
    // If set to NRF_LIBUARTE_PERIPHERAL_NOT_USED then RTC instance is used
    // or app_timer instance if _rtc1_idx is also set to NRF_LIBUARTE_PERIPHERAL_NOT_USED.
    3,
    255,
    3);

static volatile bool m_loopback_phase;
typedef struct {
    uint8_t * p_data;
    uint32_t length;
} buffer_t;

NRF_QUEUE_DEF(buffer_t, m_buf_queue, 10, NRF_QUEUE_MODE_NO_OVERFLOW);

void uart_event_handler(void * context, nrf_libuarte_async_evt_t * p_evt)
{
    nrf_libuarte_async_t * p_libuarte = (nrf_libuarte_async_t *)context;
    ret_code_t ret;

    switch (p_evt->type)
    {
        case NRF_LIBUARTE_ASYNC_EVT_ERROR:
            // bsp_board_led_invert(0);
            break;
        case NRF_LIBUARTE_ASYNC_EVT_RX_DATA:
            ret = nrf_libuarte_async_tx(p_libuarte,p_evt->data.rxtx.p_data, p_evt->data.rxtx.length);
            if (ret == NRF_ERROR_BUSY)
            {
                buffer_t buf = {
                    .p_data = p_evt->data.rxtx.p_data,
                    .length = p_evt->data.rxtx.length,
                };

                ret = nrf_queue_push(&m_buf_queue, &buf);
                APP_ERROR_CHECK(ret);
            }
            else
            {
                APP_ERROR_CHECK(ret);
            }
            bsp_board_led_invert(1);
            m_loopback_phase = true;
            break;
        case NRF_LIBUARTE_ASYNC_EVT_TX_DONE:
            if (m_loopback_phase)
            {
                nrf_libuarte_async_rx_free(p_libuarte, p_evt->data.rxtx.p_data, p_evt->data.rxtx.length);
                if (!nrf_queue_is_empty(&m_buf_queue))
                {
                    buffer_t buf;
                    ret = nrf_queue_pop(&m_buf_queue, &buf);
                    APP_ERROR_CHECK(ret);
                    UNUSED_RETURN_VALUE(nrf_libuarte_async_tx(p_libuarte, buf.p_data, buf.length));
                }
            }
            bsp_board_led_invert(2);
            break;
        default:
            break;
    }
}

typedef enum BottomEventType
{
  BE_NONE = 0,
  BE_CONNECTED,
  BE_DISCONNECTED,
  BE_NOTIFICATION_ENABLED,
  BE_NOTIFICATION_DISABLED,
  BE_SAADC,
  BE_IMUINT2,
} BottomEventType_t;

typedef struct BottomEvent
{
  BottomEventType_t type;
  void * p_data;
} BottomEvent_t;

#define BEVENTS_IN_QUEUE        4

static TaskHandle_t             m_bottom_thread;
QueueHandle_t                   m_beq;

