gingerologist/nrf5_sdk_17_10/examples/ble_peripheral/ble_app_sleepmon/main.c
static void qmi8658a_int2_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    BottomEvent_t be = { .type = BE_IMUINT2 };
    xQueueSendFromISR(m_beq, &be, NULL);
}

/* YOUR_JOB: Declare all services structure your application is using
 *  BLE_XYZ_DEF(m_xyz);
 */
#define SAMPLE_TYPE_EEG         0x01
#define SAMPLE_TYPE_IMU         0x02

/*
 *
 */
#define SAMPLES_IN_BUFFER       120

static const nrf_drv_timer_t    m_adc_timer = NRF_DRV_TIMER_INSTANCE(1);
static nrf_ppi_channel_t        m_ppi_channel;

typedef __packed struct {
    uint8_t     type;
    uint8_t     version;        // 1
    uint16_t    length;         // fixed 244
    uint32_t    seq_num;
    int16_t     sample[SAMPLES_IN_BUFFER];
} sample_packet_t;

typedef __packed struct sens_packet
{
    uint8_t preamble[8];
    uint16_t packet_type;
    uint16_t payload_len;

    uint8_t brief_tlv_type;
    uint16_t brief_tlv_len;
    uint16_t sensor_id;
    uint8_t brief_version;
    uint8_t instance_id;
    uint16_t brief_sampling_rate;
    uint8_t brief_sr_unit;
    uint8_t brief_resolution;
    uint16_t brief_vref;
    uint16_t brief_num_of_samples;

    uint8_t raw_tlv_type;               // 0x00
    uint16_t raw_tlv_len;               // 120
    int16_t sample[SAMPLES_IN_BUFFER];

    uint8_t cka;
    uint8_t ckb;
} sens_packet_t;

STATIC_ASSERT(sizeof(sens_packet_t) == 272);

#define SENS_BRIEF_TLV_LEN          12
#define SENS_PAYLOAD_LEN            (3 + SENS_BRIEF_TLV_LEN + 3 + SAMPLES_IN_BUFFER * sizeof(uint16_t))
// TODO #define SENS_BRIEF_RESOLUTION       ((NRFX_SAADC_CONFIG_RESOLUTION == 0) ? 8 : )

static sens_packet_t sens_packet_buffer = {
    .preamble = { 0x55, 0x55, 0x55, 0x55, 0x55, 0x55, 0x55, 0xd5 },
    .packet_type = 0x0101,
    .payload_len = SENS_PAYLOAD_LEN,

    .brief_tlv_type = 0xff,
    .brief_tlv_len = SENS_BRIEF_TLV_LEN,
    .sensor_id = 0xfff0,
    .brief_version = 0x00,
    .instance_id = 0x00,
    .brief_sampling_rate = 250,
    .brief_sr_unit = 0,
    .brief_resolution = 14,
    .brief_vref = 600,
    .brief_num_of_samples = SAMPLES_IN_BUFFER,

    .raw_tlv_type = 0x00,
    .raw_tlv_len = SAMPLES_IN_BUFFER * sizeof(uint16_t)
};

static sample_packet_t          m_eeg_packet[2] __attribute__((aligned(0x4))) = {
    { .type = SAMPLE_TYPE_EEG,
      .version = 1,
      .length = 244             // TODO use offset of
    },
    { .type = SAMPLE_TYPE_EEG,
      .version = 1,
      .length = 244
    },
};

static sample_packet_t          m_imu_packet = {
    .type = SAMPLE_TYPE_IMU,
    .version = 1,
    .length = 244
};


static void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        ret_code_t err_code;

        int16_t * p_buffer = p_event->data.done.p_buffer;
        if (p_buffer == m_eeg_packet[0].sample || p_buffer == m_eeg_packet[1].sample)
        {
          BottomEvent_t be = { .type = BE_SAADC };
          be.p_data = p_buffer;
          xQueueSendFromISR(m_beq, &be, NULL);
        }
        err_code = nrf_drv_saadc_buffer_convert(p_buffer, SAMPLES_IN_BUFFER);
        APP_ERROR_CHECK(err_code);
    }
}

static void adc_timer_handler(nrf_timer_event_t event_type, void * p_context)
{
}

/*
 * init adc timer and ppi, allocate and assign ppi channel
 *
 * nrf_drv_saadc_buffer_convert explained
 * https://devzone.nordicsemi.com/f/nordic-q-a/60230/what-is-the-purpose-of-nrf_drv_saadc_buffer_convert
 * https://devzone.nordicsemi.com/f/nordic-q-a/46039/configuring-adc-sampling-rate-and-simultaneous-reading-from-multiple-channels
 */
static void saadc_init(void)
{
    ret_code_t err_code;


//    nrf_saadc_channel_config_t channel_1_config =
//        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN2);

//    channel_1_config.gain = NRF_SAADC_GAIN1_4;

    nrf_drv_saadc_config_t saadc_config = NRFX_SAADC_DEFAULT_CONFIG;
    saadc_config.oversample = NRF_SAADC_OVERSAMPLE_8X;

    err_code = nrf_drv_saadc_init(&saadc_config, saadc_callback);
    APP_ERROR_CHECK(err_code);

    nrf_saadc_channel_config_t channel_0_config =
    NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN2);

    channel_0_config.gain = NRF_SAADC_GAIN1_4;
    channel_0_config.burst = NRF_SAADC_BURST_ENABLED;

    err_code = nrf_drv_saadc_channel_init(0, &channel_0_config);
    APP_ERROR_CHECK(err_code);

//    err_code = nrf_drv_saadc_channel_init(1, &channel_1_config);
//    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert((nrf_saadc_value_t *)m_eeg_packet[0].sample, SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert((nrf_saadc_value_t *)m_eeg_packet[1].sample, SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_ppi_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;
    err_code = nrf_drv_timer_init(&m_adc_timer, &timer_cfg, adc_timer_handler);
    APP_ERROR_CHECK(err_code);

    uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&m_adc_timer,
                                                                                NRF_TIMER_CC_CHANNEL0);
    uint32_t saadc_sample_task_addr   = nrf_drv_saadc_sample_task_get();

    /* setup ppi channel so that timer compare event is triggering sample task in SAADC */
    err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_ppi_channel_assign(m_ppi_channel,
                                          timer_compare_event_addr,
                                          saadc_sample_task_addr);

    APP_ERROR_CHECK(err_code);
}

static uint16_t eeg_sampling_rate()
{
    switch (m_eeg.sps_shadow)
    {
        case 1:
            return 250;
        default:
            return 125;
    }
}

/*
 * enable adc timer (according to m_eeg.sps_shadow) and ppi channel
 */
void saadc_sampling_event_enable(void)
{
    ret_code_t err_code;

    uint16_t sampling_rate = eeg_sampling_rate();
    uint32_t period = 1000 / sampling_rate;

    NRF_LOG_INFO("Set sampling rate to %d sps (%d ms)", sampling_rate, period);

//    uint32_t period;
//    uint8_t sps = m_eeg.sps_shadow;
//    if (sps == 0)
//    {
//      period = 8; // 125sps
//      NRF_LOG_INFO("Set sampling rate to 125sps (8ms)");
//    }
//    else if (sps == 1)
//    {
//      period = 4; // 250sps
//      NRF_LOG_INFO("Set sampling rate to 250sps (4ms)");
//    }
//    else
//    {
//      period = 8; // default 125sps
//      NRF_LOG_INFO("Set sampling rate to 125sps (8ms, fallback)");
//    }

    uint32_t ticks = nrf_drv_timer_ms_to_ticks(&m_adc_timer, period);
    nrf_drv_timer_extended_compare(&m_adc_timer,
                                   NRF_TIMER_CC_CHANNEL0,
                                   ticks,
                                   NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK,
                                   false);

    nrf_drv_timer_enable(&m_adc_timer);
    err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);
    APP_ERROR_CHECK(err_code);
}

