gingerologist/nrf5_sdk_17_10/examples/ble_peripheral/ble_app_sleepmon/main.c
/*
 * https://devzone.nordicsemi.com/f/nordic-q-a/95398/nrf52840-correct-freertos-logging-using-nrf_log-module
 */

#if NRF_LOG_ENABLED && NRF_LOG_DEFERRED
void log_pending_hook( void )
{
    BaseType_t YieldRequired = pdFAIL;
    if ( __get_IPSR() != 0 )
    {
        YieldRequired = xTaskResumeFromISR( m_logger_thread );
        portYIELD_FROM_ISR( YieldRequired );
    }
    else
    {
        UNUSED_RETURN_VALUE(vTaskResume(m_logger_thread));
    }
}
#endif

/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

static void simple_crc(uint8_t * buf, uint8_t * cka, uint8_t * ckb)
{
    int num = cka - buf;
    *cka = 0;
    *ckb = 0;
    for (int i = 0; i < num; i++)
    {
        *cka = *cka + buf[i];
        *ckb = *ckb + *cka;
    }
}

static void sens_log(uint16_t sampling_rate, int16_t sample[], uint16_t num_of_samples)
{
    ret_code_t err_code;

    for (int i = 0; i < num_of_samples; i++)
    {
        sens_packet_buffer.sample[i] = sample[i];
    }

    // memcpy(&sens_packet_buffer.sample[0], sample, sizeof(int16_t) * num_of_samples);
    sens_packet_buffer.brief_sampling_rate = sampling_rate;
    sens_packet_buffer.brief_num_of_samples = num_of_samples;

    simple_crc((uint8_t *)&sens_packet_buffer.packet_type, &sens_packet_buffer.cka, &sens_packet_buffer.ckb);

    err_code = nrf_libuarte_async_tx(&libuarte, (uint8_t *)&sens_packet_buffer, sizeof(sens_packet_buffer));
    APP_ERROR_CHECK(err_code);
}

static void handle_adc_data(int16_t * p_buffer, uint32_t sn)
{
    ret_code_t err_code;
    sample_packet_t * ble_pkt = NULL;

    sens_log(eeg_sampling_rate(), p_buffer, SAMPLES_IN_BUFFER);

    if (p_buffer == m_eeg_packet[0].sample)
    {
        ble_pkt = &m_eeg_packet[0];
    }
    else
    {
        ble_pkt = &m_eeg_packet[1];
    }

    ble_pkt->seq_num = sn;

    uint16_t len = sizeof(m_eeg_packet[0]);

    ble_gatts_hvx_params_t hvx_params = {0};

    hvx_params.handle = m_eeg.samples_handles.value_handle; // p_hrs->hrm_handles.value_handle;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
    hvx_params.offset = 0;
    hvx_params.p_len  = &len;                               // this is a bidirectional param
    hvx_params.p_data = (uint8_t*)ble_pkt;

    // is this required?
    if (m_eeg.conn_handle == BLE_CONN_HANDLE_INVALID)
    {
      NRF_LOG_ERROR("BLE_CONN_HANDLE_INVALID right before calling sd_ble_gatts_hvx");
      return;
    }

    err_code = sd_ble_gatts_hvx(m_eeg.conn_handle, &hvx_params);

    /*
    * 0x3002 -> BLE_ERROR_INVALID_CONN_HANDLE; defined in ble_err.h
    * 0x000c -> NRF_ERROR_DATA_SIZE;
    */
    if (err_code != NRF_SUCCESS)
    {
      NRF_LOG_ERROR("(eeg) sd_ble_gatts_hvx error, %d", err_code);
    }

    if (err_code == NRF_ERROR_DATA_SIZE)
    {
      NRF_LOG_INFO("len is %d", len);
      NRF_LOG_INFO("*(hvx_params.p_len) is %d", *(hvx_params.p_len));
    }

    if (sn % 1000 == 0)
    {
        NRF_LOG_INFO("(eeg) packet %d sent", sn);
    }
}

/**@brief Function for bottom-half (deferred interrupt handling) thread.
 */
static void bottom_thread(void * arg)
{
    ret_code_t  err_code;
    uint32_t    eeg_seq_num = 0;
    uint32_t    imu_seq_num = 0;
    int         imu_offset;
    uint8_t     status0;

    NRF_LOG_INFO("Bottom thread started");

    ks1092_init(&ks1092_dev);
    qmi8658a_init(&qmi8658a_dev);

    nrf_libuarte_async_config_t nrf_libuarte_async_config = {
            .tx_pin     = TX_PIN_NUMBER,
            .rx_pin     = RX_PIN_NUMBER,
            .baudrate   = NRF_UARTE_BAUDRATE_115200,
            .parity     = NRF_UARTE_PARITY_EXCLUDED,
            .hwfc       = NRF_UARTE_HWFC_DISABLED,
            .timeout_us = 100,
            .int_prio   = APP_IRQ_PRIORITY_LOW
    };

    err_code = nrf_libuarte_async_init(&libuarte, &nrf_libuarte_async_config, uart_event_handler, (void *)&libuarte);

    APP_ERROR_CHECK(err_code);

    nrf_libuarte_async_enable(&libuarte);

    for(;;)
    {
        BottomEvent_t be;
        xQueueReceive(m_beq, &be, portMAX_DELAY);

        switch (be.type)
        {
        case BE_NONE:
            break;
        case BE_CONNECTED:
            NRF_LOG_INFO("Connected.");
            break;
        case BE_DISCONNECTED:
            NRF_LOG_INFO("Disconnected.");
            break;
        case BE_NOTIFICATION_ENABLED: {
            err_code = ks1092_write(&ks1092_dev, m_eeg.gain_shadow, KS1092_CHAN_OFF);
            APP_ERROR_CHECK(err_code);

            saadc_sampling_event_enable();
            nrfx_gpiote_in_event_enable(QMI8658A_INT2_PIN, true);
            // qmi8658a_reset();
            // vTaskDelay(1);
            qmi8658a_config(&qmi8658a_dev);
            // vTaskDelay(1);
            // qmi8658a_enable();
            eeg_seq_num = 0;
            imu_seq_num = 0;
            imu_offset = 0;
            NRF_LOG_INFO("Start sampling (notification on)");
        } break;
        case BE_NOTIFICATION_DISABLED: {
            qmi8658a_disable(&qmi8658a_dev);
            nrfx_gpiote_in_event_enable(QMI8658A_INT2_PIN, false);
            saadc_sampling_event_disable();
            ks1092_write(&ks1092_dev, KS1092_CHAN_OFF, KS1092_CHAN_OFF);
            NRF_LOG_INFO("Stop sampling (notification off)");
        } break;
        case BE_SAADC: {
            if (eeg_sample_notifying())
            {
                handle_adc_data((int16_t*)be.p_data, eeg_seq_num++);
            }
        } break;
        case BE_IMUINT2:
            if (eeg_sample_notifying())
            {
                qmi8658a_read(&qmi8658a_dev, QMI8658A_STATUS0, &status0, 1);
                if (status0 & 0x01)
                {
                    int16_t * p = (int16_t *)&m_imu_packet.sample[imu_offset];
                    qmi8658a_read(&qmi8658a_dev, QMI8658A_AX_L, (uint8_t *)p, QMI8658A_BYTES_IN_DATA);
                    imu_offset += QMI8658A_SAMPLES_IN_DATA;

//                    NRF_LOG_INFO(
//                        "ax %d, ay %d, az %d, gx %d, gy %d, gz %d",
//                        p[0], p[1], p[2], p[3], p[4], p[5]);

                    if (imu_offset >= SAMPLES_IN_BUFFER)
                    {
                        imu_offset = 0;
                        m_imu_packet.seq_num = imu_seq_num;

