gingerologist/nrf5_sdk_17_10/examples/ble_peripheral/ble_app_sleepmon/main.c
                        uint16_t len = sizeof(m_imu_packet);

                        ble_gatts_hvx_params_t hvx_params = {0};

                        hvx_params.handle = m_eeg.samples_handles.value_handle; // p_hrs->hrm_handles.value_handle;
                        hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
                        hvx_params.offset = 0;
                        hvx_params.p_len  = &len;                   // this is a bidirectional param
                        hvx_params.p_data = (uint8_t*)&m_imu_packet;

                        ret_code_t err_code = sd_ble_gatts_hvx(m_eeg.conn_handle, &hvx_params);

                        /*
                        * 0x3002 -> BLE_ERROR_INVALID_CONN_HANDLE; defined in ble_err.h
                        * 0x000c -> NRF_ERROR_DATA_SIZE;
                        * 0x0013 -> NRF_ERROR_RESOURCES, probably wrong timing
                        */
                        if (err_code != NRF_SUCCESS)
                        {
                            // TODO output INVALID_CONN_HANDLE
                            NRF_LOG_ERROR("(imu) sd_ble_gatts_hvx error, 0x%04x", err_code);
                        }

                        if (err_code == NRF_ERROR_DATA_SIZE)
                        {
                            NRF_LOG_INFO("len is %d", len);
                            NRF_LOG_INFO("*(hvx_params.p_len) is %d", *(hvx_params.p_len));
                        }

                        if (imu_seq_num % 1000 == 0)
                        {
                            NRF_LOG_INFO("(imu) packet %d sent", imu_seq_num);
                        }

                        imu_seq_num++;
                    }
                }
            }
            break;
        }
    }
}

/**@brief Function for log power-on reset reason
 */
void log_reset_reason(uint32_t reason)
{
    //
}

/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t err_code;
    bool erase_bonds;

    // this is going to be initialized by ble stack
    // nrf_drv_clock_init();

    // Initialize.
    log_init();
    NRF_LOG_RAW_INFO("\n^^^ sleepmon start ^^^\n");

 #if NRF_LOG_ENABLED
    // Start execution.
    if (pdPASS != xTaskCreate(logger_thread, "LOGGER", 256, NULL, 1, &m_logger_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
#endif

    // https://devzone.nordicsemi.com/f/nordic-q-a/38405/detect-wake-up-reason-from-deep-sleep
    uint32_t reset_reason = 0;
    reset_reason = nrf_power_resetreas_get();   // NRF_POWER->RESETREAS;
    NRF_LOG_INFO("reset reason: 0x%08x", reset_reason);
    nrf_power_resetreas_clear(reset_reason);    // NRF_POWER->RESETREAS = NRF_POWER->RESETREAS;

    timers_init();
    buttons_leds_init(&erase_bonds);

    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    conn_params_init();
    peer_manager_init();

    application_timers_start();

    // NRF_SDH_BLE_GATT_MAX_MTU_SIZE is definedin sdk_config.h
    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);

    // Start execution.
    nrf_sdh_freertos_init(advertising_start, &erase_bonds);

    m_beq = xQueueCreate(BEVENTS_IN_QUEUE, sizeof(BottomEvent_t));
    if (m_beq == NULL)
    {
      APP_ERROR_CHECK(NRF_ERROR_NO_MEM);
    }

    if (pdPASS != xTaskCreate(bottom_thread, "BOTTOM", 256, NULL, 1, &m_bottom_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    vTaskStartScheduler();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
